Revit 2027 API
RebarBendingDetailType.AngularDimensionTextPosition Property
 Identifies the text position with respect to dimension line.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }
Public Property AngularDimensionTextPosition As BendingDetailDimensionTextPosition
	Get
	Set
public:
property BendingDetailDimensionTextPosition AngularDimensionTextPosition {
	BendingDetailDimensionTextPosition get ();
	void set (BendingDetailDimensionTextPosition value);
}
member AngularDimensionTextPosition : BendingDetailDimensionTextPosition with get, set
Property Value
BendingDetailDimensionTextPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace